---
kind: enumMember
id: F:Autodesk.Revit.DB.FillPatternHostOrientation.ToView
enum: Autodesk.Revit.DB.FillPatternHostOrientation
source: html/77580679-4563-f4f8-0253-af7215d4dea6.htm
---
# Autodesk.Revit.DB.FillPatternHostOrientation.ToView

All patterns share the same orientation and origin with respect to view, so they perfectly align at element transitions.